Revit 2024 API
ElectricalDemandFactorValue Constructor
 Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElectricalDemandFactorValue()
Visual Basic
Public Sub New
Visual C++
public:
ElectricalDemandFactorValue()
See Also
ElectricalDemandFactorValue Class
ElectricalDemandFactorValue Overload
Autodesk.Revit.DB.Electrical Namespace